results/main/a3_latency.txt
=== a3_latency: 延迟分布 (带详细分位) ===
分支: main
时间: 2026-05-30T16:08:46+08:00
---
Running 30s test @ http://localhost:18980/bench/json
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.76ms  221.34ms   1.83s    96.08%
    Req/Sec     8.83k   728.13    10.42k    85.88%
  Latency Distribution
     50%    2.54ms
     75%    4.73ms
     90%    7.86ms
     99%    1.43s 
  1061291 requests in 31.91s, 179.15MB read
  Socket errors: connect 0, read 1061654, write 0, timeout 0
Requests/sec:  33255.83
Transfer/sec:      5.61MB